; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-2-3-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-3 - location
	p1-0 - location
	p1-5 - location
	p2-3 - location
	p2-6 - location
	p3-4 - location
	p4-0 - location
	p4-1 - location
	p4-2 - location
	p5-0 - location
	p6-3 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at package1 s6)
	(at package2 s2)
	(at package3 s3)
	(at package4 s0)
	(at package5 s5)
	(at package6 s5)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s6)
	(link s6 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s6)
	(link s6 s3)
	(link s4 s0)
	(link s0 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s2)
	(link s2 s6)
	(link s6 s4)
	(link s4 s6)
	(link s6 s5)
	(link s5 s6)
)
	(:goal (and
	(at driver2 s4)
	(at truck2 s4)
	(at package1 s6)
	(at package2 s3)
	(at package3 s4)
	(at package4 s6)
	(at package5 s1)
	))

)

; plan
1. (walk driver1 s6 p2-6)
   deleted: (at driver1 s6)
   added: (at driver1 p2-6)
   goals met: 1 of 7
2. (walk driver1 p2-6 s2)
   deleted: (at driver1 p2-6)
   added: (at driver1 s2)
   goals met: 1 of 7
3. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 7
4. (drive-truck truck2 s2 s4 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 2 of 7
5. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 7
6. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 2 of 7
7. (drive-truck truck1 s0 s6 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   goals met: 2 of 7
8. (unload-truck package4 truck1 s6)
   deleted: (in package4 truck1)
   added: (at package4 s6)
   goals met: 3 of 7
9. (drive-truck truck1 s6 s0 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 3 of 7
10. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 3 of 7
11. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 3 of 7
12. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 3 of 7
13. (load-truck package5 truck1 s5)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 3 of 7
14. (drive-truck truck1 s5 s1 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 3 of 7
15. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 4 of 7
16. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 4 of 7
17. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 5 of 7
18. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 5 of 7
19. (drive-truck truck1 s3 s6 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 5 of 7
20. (drive-truck truck1 s6 s4 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 5 of 7
21. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 6 of 7
22. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 7 of 7
